nguyentri/da-pac/svd/DA14683.svd
<?xml version="1.0" encoding="ascii"?>
<!-- File naming: Dialog_DA14680BB.svd -->
<!--
  Copyright (C) 2018 Dialog Semiconductor.
  This computer program includes Confidential, Proprietary Information  
  of Dialog Semiconductor. All Rights Reserved.

  Purpose: System Viewer Description (SVD) Example (Schema Version 1.1)
           This is a description of a none-existent and incomplete device
		   for demonstration purposes only.

  Generated by cmsis-svd (version 0.2), d.d. October 04, 2018 - 09:12:19
 -->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <vendor>Dialog</vendor>                   				    <!-- device vendor name -->
  <vendorID>ARM</vendorID>                                        <!-- device vendor short name -->
  <name>DA14683</name>                                          <!-- name of part-->
  <series>DA14683</series>                                         <!-- device series the device belongs to -->
  <version>1.2</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <description>DA1468x</description>
  <licenseText><!-- this license text will appear in header file. \n forces line breaks -->
    Copyright (C) 2018 Dialog Semiconductor.\n
    This computer program includes Confidential, Proprietary Information  \n
    of Dialog Semiconductor. All Rights Reserved.\n
    \n
    Dialog GmbH (DLG) is supplying this software for use with Cortex-M\n
    processor based microcontroller, but can be equally used for other\n
    suitable  processor architectures. This file can be freely distributed.\n
    Modifications to this file shall be clearly marked.\n
    \n
    THIS SOFTWARE IS PROVIDED  AS IS .  NO WARRANTIES, WHETHER EXPRESS, IMPLIED\n
    OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF\n
    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.\n
    ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR\n
    CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
    
</licenseText>
  <cpu><!-- details about the cpu embedded in the device (SVD version 1.2,  see https://www.keil.com/pack/doc/CMSIS/SVD/html/group__cpu_section__gr.html) -->
    <name>CM0</name>
    <revision>r1p0</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
		
  </cpu>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
																																									 and register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->
	
  <peripherals>
	<peripheral>  
  <name>NVIC</name>
  <version>1.0</version>
  <description>Cortex M0 NVIC registers</description>
  <groupName>NVIC</groupName>
  <baseAddress>0xE000E100</baseAddress>
  <size>0</size>
  <addressBlock>
		<offset>0</offset>
		<size>0x321</size>
		<usage>registers</usage>
  </addressBlock>
  <registers>
	<register>
	  <name>ISER</name>
	  <description>Interrupt set-enable register</description>
	  <addressOffset>0x00000000</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>BLE_WAKEUP_LP_IRQn</name>
		  <description>BLE_WAKEUP_LP_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[0:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_GEN_IRQn</name>
		  <description>BLE_GEN_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>FTDF_WAKEUP_IRQn</name>
		  <description>FTDF_WAKEUP_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>FTDF_GEN_IRQn</name>
		  <description>FTDF_GEN_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[3:3]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RFCAL_IRQn</name>
		  <description>RFCAL_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[4:4]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>COEX_IRQn</name>
		  <description>COEX_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[5:5]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>CRYPTO_IRQn</name>
		  <description>CRYPTO_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[6:6]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>MRM_IRQn</name>
		  <description>MRM_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[7:7]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART_IRQn</name>
		  <description>UART_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[8:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART2_IRQn</name>
		  <description>UART2_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[9:9]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C_IRQn</name>
		  <description>I2C_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[10:10]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C2_IRQn</name>
		  <description>I2C2_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[11:11]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI_IRQn</name>
		  <description>SPI_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[12:12]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI2_IRQn</name>
		  <description>SPI2_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[13:13]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ADC_IRQn</name>
		  <description>ADC_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[14:14]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>KEYBRD_IRQn</name>
		  <description>KEYBRD_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[15:15]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>IRGEN_IRQn</name>
		  <description>IRGEN_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[16:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>WKUP_GPIO_IRQn</name>
		  <description>WKUP_GPIO_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[17:17]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM0_IRQn</name>
		  <description>SWTIM0_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[18:18]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM1_IRQn</name>
		  <description>SWTIM1_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[19:19]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>QUADEC_IRQn</name>
		  <description>QUADEC_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[20:20]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>USB_IRQn</name>
		  <description>USB_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[21:21]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PCM_IRQn</name>
		  <description>PCM_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[22:22]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_IN_IRQn</name>
		  <description>SRC_IN_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[23:23]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_OUT_IRQn</name>
		  <description>SRC_OUT_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[24:24]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>VBUS_IRQn</name>
		  <description>VBUS_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[25:25]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DMA_IRQn</name>
		  <description>DMA_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[26:26]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RF_DIAG_IRQn</name>
		  <description>RF_DIAG_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[27:27]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>TRNG_IRQn</name>
		  <description>TRNG_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[28:28]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DCDC_IRQn</name>
		  <description>DCDC_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[29:29]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>XTAL16RDY_IRQn</name>
		  <description>XTAL16RDY_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[30:30]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>Rsvd__irq__n</name>
		  <description>Rsvd__irq__n (Reserved)</description>
		  <bitRange>[31:31]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>ICER</name>
	  <description>Interrupt clear-enable register</description>
	  <addressOffset>0x00000080</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>BLE_WAKEUP_LP_IRQn</name>
		  <description>BLE_WAKEUP_LP_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[0:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_GEN_IRQn</name>
		  <description>BLE_GEN_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>FTDF_WAKEUP_IRQn</name>
		  <description>FTDF_WAKEUP_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>FTDF_GEN_IRQn</name>
		  <description>FTDF_GEN_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[3:3]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RFCAL_IRQn</name>
		  <description>RFCAL_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[4:4]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>COEX_IRQn</name>
		  <description>COEX_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[5:5]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>CRYPTO_IRQn</name>
		  <description>CRYPTO_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[6:6]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>MRM_IRQn</name>
		  <description>MRM_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[7:7]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART_IRQn</name>
		  <description>UART_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[8:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART2_IRQn</name>
		  <description>UART2_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[9:9]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C_IRQn</name>
		  <description>I2C_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[10:10]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C2_IRQn</name>
		  <description>I2C2_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[11:11]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI_IRQn</name>
		  <description>SPI_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[12:12]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI2_IRQn</name>
		  <description>SPI2_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[13:13]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ADC_IRQn</name>
		  <description>ADC_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[14:14]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>KEYBRD_IRQn</name>
		  <description>KEYBRD_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[15:15]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>IRGEN_IRQn</name>
		  <description>IRGEN_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[16:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>WKUP_GPIO_IRQn</name>
		  <description>WKUP_GPIO_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[17:17]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM0_IRQn</name>
		  <description>SWTIM0_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[18:18]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM1_IRQn</name>
		  <description>SWTIM1_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[19:19]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>QUADEC_IRQn</name>
		  <description>QUADEC_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[20:20]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>USB_IRQn</name>
		  <description>USB_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[21:21]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PCM_IRQn</name>
		  <description>PCM_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[22:22]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_IN_IRQn</name>
		  <description>SRC_IN_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[23:23]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_OUT_IRQn</name>
		  <description>SRC_OUT_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[24:24]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>VBUS_IRQn</name>
		  <description>VBUS_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[25:25]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DMA_IRQn</name>
		  <description>DMA_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[26:26]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RF_DIAG_IRQn</name>
		  <description>RF_DIAG_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[27:27]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>TRNG_IRQn</name>
		  <description>TRNG_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[28:28]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DCDC_IRQn</name>
		  <description>DCDC_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[29:29]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>XTAL16RDY_IRQn</name>
		  <description>XTAL16RDY_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[30:30]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>Rsvd__irq__n</name>
		  <description>Rsvd__irq__n (Reserved)</description>
		  <bitRange>[31:31]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>ISPR</name>
	  <description>Interrupt set-pending register</description>
	  <addressOffset>0x00000100</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>BLE_WAKEUP_LP_IRQn</name>
		  <description>BLE_WAKEUP_LP_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[0:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_GEN_IRQn</name>
		  <description>BLE_GEN_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>FTDF_WAKEUP_IRQn</name>
		  <description>FTDF_WAKEUP_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>FTDF_GEN_IRQn</name>
		  <description>FTDF_GEN_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[3:3]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RFCAL_IRQn</name>
		  <description>RFCAL_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[4:4]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>COEX_IRQn</name>
		  <description>COEX_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[5:5]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>CRYPTO_IRQn</name>
		  <description>CRYPTO_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[6:6]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>MRM_IRQn</name>
		  <description>MRM_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[7:7]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART_IRQn</name>
		  <description>UART_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[8:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART2_IRQn</name>
		  <description>UART2_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[9:9]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C_IRQn</name>
		  <description>I2C_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[10:10]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C2_IRQn</name>
		  <description>I2C2_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[11:11]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI_IRQn</name>
		  <description>SPI_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[12:12]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI2_IRQn</name>
		  <description>SPI2_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[13:13]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ADC_IRQn</name>
		  <description>ADC_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[14:14]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>KEYBRD_IRQn</name>
		  <description>KEYBRD_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[15:15]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>IRGEN_IRQn</name>
		  <description>IRGEN_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[16:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>WKUP_GPIO_IRQn</name>
		  <description>WKUP_GPIO_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[17:17]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM0_IRQn</name>
		  <description>SWTIM0_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[18:18]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM1_IRQn</name>
		  <description>SWTIM1_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[19:19]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>QUADEC_IRQn</name>
		  <description>QUADEC_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[20:20]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>USB_IRQn</name>
		  <description>USB_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[21:21]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PCM_IRQn</name>
		  <description>PCM_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[22:22]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_IN_IRQn</name>
		  <description>SRC_IN_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[23:23]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_OUT_IRQn</name>
		  <description>SRC_OUT_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[24:24]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>VBUS_IRQn</name>
		  <description>VBUS_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[25:25]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DMA_IRQn</name>
		  <description>DMA_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[26:26]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RF_DIAG_IRQn</name>
		  <description>RF_DIAG_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[27:27]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>TRNG_IRQn</name>
		  <description>TRNG_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[28:28]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DCDC_IRQn</name>
		  <description>DCDC_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[29:29]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>XTAL16RDY_IRQn</name>
		  <description>XTAL16RDY_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[30:30]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>Rsvd__irq__n</name>
		  <description>Rsvd__irq__n (Reserved)</description>
		  <bitRange>[31:31]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
