nguyentri/da-pac/svd/DA14683.svd
	<registers>
	<register>
	<name>ANA_STATUS_REG</name>
	<description>status bit of analog (power management) circuits</description>
	<addressOffset>0x0000002a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000090</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COMP_1V8_PA_HIGH</name>
	<description>VDD1V8P &gt; 1.7V </description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_1V8_FLASH_HIGH</name>
	<description>VDD1V8 &gt; 1.7V</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_V33_HIGH</name>
	<description>V33 &gt; 1.7V</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_VBUS_LOW</name>
	<description>VBUS &gt; 3.4V</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_VBUS_HIGH</name>
	<description>VBUS &gt; 4V</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_1V8_FLASH_OK</name>
	<description>ldo_vdd1v8 = ok</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_1V8_PA_OK</name>
	<description>ldo_vdd1v8P = ok</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_CORE_OK</name>
	<description>ldo_core = ok</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_VDD_HIGH</name>
	<description>VDD &gt; 1.13V</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BANDGAP_OK</name>
	<description>bandgap = ok
</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_SUPPLY_USB_OK</name>
	<description>ldo_supply_usb = ok</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_SUPPLY_VBAT_OK</name>
	<description>ldo_supply_vbat =ok</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>NEWBAT</name>
	<description>new battery has been detected</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VBUS_AVAILABLE</name>
	<description>vbus is available (vbus &gt; vbat)</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_VBAT_OK</name>
	<description>vbat &gt; 1.7V</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_RADIO_OK</name>
	<description>ldo_radio = ok</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BANDGAP_REG</name>
	<description>bandgap trimming</description>
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>LDO_SUPPLY_USE_BGREF</name>
	<description>0x0 -&gt; LDO_SUPPLY_(VBAT/USB) uses V12 voltage/(V12/2Mohm) current as reference
0x1 -&gt; LDO_SUPPLY_(VBAT/USB) uses bandgap voltage/bandgap current (1uA) as reference -&gt; set 0x1 in (booter-)software
Switch to 0x1 at start of user application when maximum BOD functionality is switched on.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_SLEEP_TRIM</name>
	<description>0x4 --&gt; 1120 mV
0x5 --&gt; 1089 mV
0x6 --&gt; 1058 mV
0x7 --&gt; 1030 mV
0x0 --&gt; 1037 mV
0x1 --&gt; 1005 mV
0x2 --&gt; 978 mV
0x3 --&gt; 946 mV
0x8 --&gt; 952 mV
0x9 --&gt; 918 mV
0xA --&gt; 889 mV
0xB --&gt; 861 mV
0xC --&gt; 862 mV
0xD --&gt; 828 mV
0xE --&gt; 798 mV
0xF --&gt; 770 mV
These values are from simulation and vary over corners</description>
	<bitRange>[13:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BGR_ITRIM</name>
	<description>Current trimming for bias </description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BGR_TRIM</name>
	<description>Trim register for bandgap </description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOD_CTRL2_REG</name>
	<description>Brown Out Detection control register</description>
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>BOD_V14_EN</name>
	<description>V14 BOD Enable</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VBAT_EN</name>
	<description>VBAT BOD Enable</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_1V8_FLASH_EN</name>
	<description>1V8 Flash BOD Enable</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_1V8_PA_EN</name>
	<description>1V8 PA BOD Enable</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V33_EN</name>
	<description>V33 BOD Enable</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VDD_EN</name>
	<description>VDD BOD Enable</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_RESET_EN</name>
	<description>Generate a chip reset on BOD event</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOD_STATUS_REG</name>
	<description>Brown Out Detection status register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>BOD_V14_LOW</name>
	<description>Indicates V14 &gt; V14_Trigger</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VBAT_LOW</name>
	<description>Indicates VBAT &gt; VBAT_Trigger</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_V33_LOW</name>
	<description>Indicates V33 &gt; V33_Trigger</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_1V8_FLASH_LOW</name>
	<description>Indicates V18_Flash &gt; V18_Flash_Trigger</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_1V8_PA_LOW</name>
	<description>Indicates V18_PA &gt; V18_PA_Trigger</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VDD_LOW</name>
	<description>Indicates VDD &gt; VDD_Trigger</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CLK_AMBA_REG</name>
	<description>HCLK, PCLK, divider and clock gates</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000022</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields><field>
	<name>QSPI_ENABLE</name>
	<description>Clock enable for QSPI controller </description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QSPI_DIV</name>
	<description>QSPI divider
00 = divide by 1
01 = divide by 2
10 = divide by 4
11 = divide by 8</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTP_ENABLE</name>
	<description>Clock enable for OTP controller </description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRNG_CLK_ENABLE</name>
	<description>Clock enable for TRNG block </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ECC_CLK_ENABLE</name>
	<description>Clock enable for ECC block </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AES_CLK_ENABLE</name>
	<description>Clock enable for AES crypto block </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PCLK_DIV</name>
	<description>APB interface clock, Cascaded with HCLK:
00 = divide hclk by 1
01 = divide hclk by 2
10 = divide hclk by 4
11 = divide hclk by 8 </description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HCLK_DIV</name>
	<description>AHB interface and microprocessor clock. Source clock divided by:
000 = divide hclk by 1
001 = divide hclk by 2
010 = divide hclk by 4
011 = divide hclk by 8
1xx = divide hclk by 16</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_FREQ_TRIM_REG</name>
	<description>Xtal frequency trimming register.</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields><field>
	<name>COARSE_ADJ</name>
	<description>Xtal frequency course trimming register.
0x0 = lowest frequency
0x7 = highest frequencyIncrement or decrement the binary value with 1. Wait approximately 200usec to allow the adjustment to settle. </description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FINE_ADJ</name>
	<description>Xtal frequency fine trimming register.0x00 = lowest frequency
0xFF = highest frequency </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_RADIO_REG</name>
	<description>Radio PLL control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000040</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>FTDF_MAC_ENABLE</name>
	<description>Enable the FTDF MAC core clocks </description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FTDF_MAC_DIV</name>
	<description>Division factor for FTCF MAC clock, relative to the DIVN clock
00 = Divide by 1
01 = Divide by 2
10 = Divide by 4
11 = Divide by 8
It should always be set to 00.</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_ENABLE</name>
	<description>Enable the BLE core clocks.
When the BLE system clock is disabled, either due to the CLK_RADIO_REG[BLE_ENABLE] or due to the PMU_CTRL_REG[BLE_SLEEP], then any access to the BLE Register file will issue a hard fault to the CPU.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_LP_RESET</name>
	<description>Reset for the BLE LP timer </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_DIV</name>
	<description>Division factor for BLE core blocks, having as reference the DIVN clock:
00 = Divide by 1
01 = Divide by 2
10 = Divide by 4
11 = Divide by 8
The programmed frequency should not be lower than 8MHz, not faster than 16MHz and not faster than the programmed CPU clock frequency. Refer also to BLE_CNTL2_REG[BLE_CLK_SEL].</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFCU_ENABLE</name>
	<description>Enable the RF control Unit clock </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFCU_DIV</name>
	<description>Division factor for RF Control Unit
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8
The programmed frequency must be exactly 8MHz. </description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_RCX20K_REG</name>
	<description>RCX-oscillator control register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000004c2</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>RCX20K_ENABLE</name>
	<description>Enable the RCX oscillator</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCX20K_LOWF</name>
	<description>Extra low frequency</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCX20K_BIAS</name>
	<description>Bias control</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCX20K_NTC</name>
	<description>Temperature control</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCX20K_TRIM</name>
	<description>0000 = lowest frequency
0111 = default
1111 = highest frequency </description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_TMR_REG</name>
	<description>Clock control for the timers</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>P06_TMR1_PWM_MODE</name>
	<description>Maps Timer1_pwm onto P06, when DEBUGGER_EN = '0'.
This state is preserved during deep sleep, to allow PWM output on the pad during deep sleep.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WAKEUPCT_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BREATH_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMR2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMR2_ENABLE</name>
	<description>Enable timer clock</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMR2_DIV</name>
	<description>Division factor for Timer
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMR1_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMR1_ENABLE</name>
	<description>Enable timer clock</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMR1_DIV</name>
	<description>Division factor for Timer
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMR0_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMR0_ENABLE</name>
	<description>Enable timer clock</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMR0_DIV</name>
	<description>Division factor for Timer
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DISCHARGE_RAIL_REG</name>
	<description>Immediate rail resetting. There is no LDO/DCDC gating</description>
	<addressOffset>0x0000006a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>RESET_V18P</name>
	<description>1: Enables immediate discharging of the V18P rail. Note that the source is not disabled.
0: disable immediate discharging of the V18P rail.
This bit is ORed with the automatic function controlled by PMU_RESET_RAIL_REG.RESET_V18P</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESET_V18</name>
	<description>1: Enables immediate discharging of the V18 rail. Note that the source is not disabled.
0: disable immediate discharging of the V18 rail.
This bit is ORed with the automatic function controlled by PMU_RESET_RAIL_REG.RESET_V18</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESET_V14</name>
	<description>1: Enables immediate discharging of the V14 rail. Note that the source is not disabled.
0: disable immediate discharging of the V14 rail.
This bit is ORed with the automatic function controlled by PMU_RESET_RAIL_REG.RESET_V14</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LDO_CTRL1_REG</name>
	<description>LDO control register</description>
	<addressOffset>0x0000003a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000057</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>LDO_RADIO_ENABLE</name>
	<description>Enables (1) or disables (0) LDO_RADIO
For fast XTAL startup, this bit may be kept to '1' during deep sleep. The LDO is switched off automatically when in deep sleep, and enabled when waking up.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RADIO_SETVDD</name>
	<description>Sets the output voltage of LDO_RADIO
000 = 1.30 V
001 = 1.35 V
010 = 1.40 V
011 = 1.45 V
1XX = 1.50 V</description>
	<bitRange>[13:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_SETVDD</name>
	<description>Sets the output voltage of LDO_CORE
000 = 1.20 V
001 = 1.15 V
010 = 1.10 V
011 = 1.05 V
1XX = 1.32 V</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_SUPPLY_USB_LEVEL</name>
	<description>Sets the output voltage of LDO_SUPPLY_USB
00 = 2.40 V
01 = 3.30 V
10 = 3.45 V
11 = 3.00 V</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_SUPPLY_VBAT_LEVEL</name>
	<description>Sets the output voltage of LDO_SUPPLY_VBAT
00 = 2.40 V
01 = 3.30 V
10 = 3.45 V
11 = 3.00 V</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VBAT_RET_LEVEL</name>
	<description>Sets the output voltage of LDO_VBAT_RET
00 = 2.40 V
01 = 3.30 V
10 = 3.45 V
11 = 3.00 V</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_CURLIM</name>
	<description>Sets the current limit of LDO_CORE
00 = Current limiter disabled
01 = 8 mA
10 = 60 mA
11 = 80 mA</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LDO_CTRL2_REG</name>
	<description>LDO control register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>LDO_1V8_PA_RET_DISABLE</name>
	<description>Disables (1) or enables (0) LDO_1V8_PA_RET</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_1V8_FLASH_RET_DISABLE</name>
	<description>Disables (1) or enables (0) LDO_1V8_FLASH_RET</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VBAT_RET_DISABLE</name>
	<description>Disables (1) or enables (0) LDO_VBAT_RET</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_1V8_PA_ON</name>
	<description>Enables (1) or disables (0) LDO_1V8_PA</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_1V8_FLASH_ON</name>
	<description>Enables (1) or disables (0) LDO_1V8_FLASH</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_3V3_ON</name>
	<description>Enables (1) or disables (0) LDO_SUPPLY_VBAT and LDO_SUPPLY_USB</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_1V2_ON</name>
	<description>Enables (1) or disables (0) LDO_CORE</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LDO_CTRL3_REG</name>
	<description>Retention LDO control register</description>
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>LDO_1V8_PA_RET_VREF_HOLD</name>
	<description>Setting of this register is &quot;ORed&quot; with the vref_hold
control from the CRG StateMachine.
&quot;0&quot; = CRG controls the T&amp;H of Vref.
&quot;1&quot; = T&amp;H is always in &quot;Hold&quot;</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_1V8_PA_RET_ENABLE</name>
	<description>Setting of this register is &quot;ORed&quot; with the ldo_enable
control from the CRG StateMachine.
&quot;0&quot; = CRG controls the enable of the LDO.
&quot;1&quot; = LDO is always enabled
To activate a retention LDO in &quot;active-mode&quot;, this bit
must be &quot;1&quot; and the VREF_HOLD bit must be &quot;0&quot;.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_1V8_FLASH_RET_VREF_HOLD</name>
	<description>Setting of this register is &quot;ORed&quot; with the vref_hold
control from the CRG StateMachine.
&quot;0&quot; = CRG controls the T&amp;H of Vref.
&quot;1&quot; = T&amp;H is always in &quot;Hold&quot;</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_1V8_FLASH_RET_ENABLE</name>
	<description>Setting of this register is &quot;ORed&quot; with the ldo_enable
control from the CRG StateMachine.
&quot;0&quot; = CRG controls the enable of the LDO.
&quot;1&quot; = LDO is always enabled
To activate a retention LDO in &quot;active-mode&quot;, this bit
must be &quot;1&quot; and the VREF_HOLD bit must be &quot;0&quot;.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VBAT_RET_VREF_HOLD</name>
	<description>Setting of this register is &quot;ORed&quot; with the vref_hold
control from the CRG StateMachine.
&quot;0&quot; = CRG controls the T&amp;H of Vref.
&quot;1&quot; = T&amp;H is always in &quot;Hold&quot;</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VBAT_RET_ENABLE</name>
	<description>Setting of this register is &quot;ORed&quot; with the ldo_enable
control from the CRG StateMachine.
&quot;0&quot; = CRG controls the enable of the LDO.
&quot;1&quot; = LDO is always enabled
To activate a retention LDO in &quot;active-mode&quot;, this bit
must be &quot;1&quot; and the VREF_HOLD bit must be &quot;0&quot;.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PMU_CTRL_REG</name>
	<description>Power Management Unit control register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RETAIN_ECCRAM</name>
	<description>Selects the retainability of the ECC u-Code RAM during deep sleep.
'1' is retainable, '0' is power gated</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RETAIN_CACHE</name>
	<description>Selects the retainability of the cache block during deep sleep.
'1' is retainable, '0' is power gated</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ENABLE_CLKLESS</name>
	<description>Selects the clockless sleep mode. Wakeup is done asynchronously.
When set to '1', the lp_clk is stopped during deep sleep, until a wakeup event (not debounced) is detected by the WAKUPCT block.
When set to '0', the lp_clk continues running, so the MAC counters keep on running.
