nguyentri/da-pac/svd/DA14683.svd
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_2_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>EDSCANDURATION</name>
	<description>The length of ED scan in symbol periods. </description>
	<bitRange>[31:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EDSCANENABLE</name>
	<description>If set to '1', the Energy Detect scan will be performed when RxEnable is set to '1' rather than starting a receive action.
The length of this scan is defined by EdScanDuration. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_3_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x070004c4</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields><field>
	<name>FTDF_LPDP_ENABLE</name>
	<description>If set, not only is FP_override and SA matching done on data_request frames but to all command and data frame types (in normal mode) </description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FP_FORCE_VALUE</name>
	<description>In case the control register FP_override is set, the value of the control register FP_force_value will always be the value of the FP bit in the automatic ACK response frame. </description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FP_OVERRIDE</name>
	<description>In case the control register FP_override is set, the value of the control register FP_force_value will always be the value of the FP bit in the automatic ACK response frame. </description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADDR_TAB_MATCH_FP_VALUE</name>
	<description>In case the received source address matches with one of the Exp_SA registers, the value of the control register Addr_tap_match_FP_value will be inserted on the position of the FP bit.
In case there is no match found, the inverse value of Addr_tap_match_FP_value will be inserted. </description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CCAIDLEWAIT</name>
	<description>Time to wait (in us) after CCA returned medium idle before starting TX-ON.
Notes:
1) extra wait times are involved before a packet is really transmitted, see the relevant timing figures.
2) not applicable in TSCH mode since there macTSRxTx shall be used. </description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACMAXFRAMETOTALWAITTIME</name>
	<description>Max time to wait (in symbol periods) for a requested Data Frame or an announced broadcast frame, triggered by the FP bit in the received frame was set to '1'. </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_4_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PHYACKATTR_HSI</name>
	<description>HighSide injection. </description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYACKATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<bitRange>[30:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYACKATTR_CALCAP</name>
	<description>CalCap value. </description>
	<bitRange>[27:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYACKATTR_CN</name>
	<description>Channel Number. </description>
	<bitRange>[23:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYACKATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXPIPEPROPDELAY</name>
	<description>The control register RxPipePropDelay indicates the propagation delay in ~s of the Rx pipeline between the last symbol being captured at the DPHY interface and the data valid indication to the LMAC controller. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYSLEEPWAIT</name>
	<description>The minume time (in us) required between the clear to '0' and set to '1' of PHY_EN.
When the signal PHY_EN is deasserted, it will not be asserted within the time phySleepWait. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_5_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000008c0</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PHYCSMACAATTR_HSI</name>
	<description>HighSide injection. </description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYCSMACAATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<bitRange>[30:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYCSMACAATTR_CALCAP</name>
	<description>CalCap value. </description>
	<bitRange>[27:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYCSMACAATTR_CN</name>
	<description>Channel Number. </description>
	<bitRange>[23:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYCSMACAATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CCASTATWAIT</name>
	<description>The output CCASTAT is valid after 8 symbols + phyRxStartup.
The 8 symbols are programmable by control registerCcaStatWait (in symbol periods).
Default value is 8d. </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ACK_RESPONSE_DELAY</name>
	<description>In order to have some flexibility the control register Ack_Response_Delay indicates the Acknowledge response time in ~s.
The default value shall is 192 ~s (12 symbols). </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_6_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000c0c28</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>WUIFSPERIOD</name>
	<description>The WakeUp IFS period is programmable by WUifsPeriod (in symbols).
The default is 12 symbols (192 us). </description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIFSPERIOD</name>
	<description>The Short IFS period is programmable by SifsPeriod (in symbols).
The default is 12 symbols (192 is). </description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LIFSPERIOD</name>
	<description>The Long IFS period is programmable by LifsPeriod (in symbols).
The default is 40 symbols (640 us), </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_7_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00420000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACCSLSAMPLEPERIOD</name>
	<description>In CSL mode, when performing a idle listening, the receiver is enabled for at least macCSLsamplePeriod (in symbol oeriods). </description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACWUPERIOD</name>
	<description>In CSL mode, the Wake-up duration in symbol periods. During this period, Wake-up frames will be transmitted. </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_8_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACCSLSTARTSAMPLETIME</name>
	<description>In CSL mode, the control register macCSLstartSampleTime indicates the TimeStamp generator time (in symbol periods) when to start listening (called idle listening) or transmitting (when tx_flag_status is set). </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_9_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACCSLFRAMEPENDINGWAITT</name>
	<description>In CSL mode, if a non Wake-up frame with Frame Pending bit = '1' is received, the receiver is enabled for at least an extra period of macCSLFramePendingWaitT (in symbol periods) after the end of the received frame.
The time the Enhanced ACK transmission lasts (if applicable) is included in this time. </description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACCSLDATAPERIOD</name>
	<description>In CSL mode, after the wake-up sequence a data frame is expected. The receiver will be enabled for at least a period of macCSLdataPeriod (in symbol periods). </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_DELTA_REG</name>
	<description>Lmac delta control register</description>
	<addressOffset>0x00010070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007e</resetMask>
	<fields><field>
	<name>WAKEUPTIMERENABLESTATUS_D</name>
	<description>Delta which indicates that WakeupTimerEnableStatus has changed
This delta bit is set to '1' on each change of this status, contributes to ftdf_ce[3]. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GETGENERATORVAL_E</name>
	<description>Event, set to '1' to indicate that the the getGeneratorVal request is completed.
This event bit contributes to ftdf_ce[3]. </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYMBOLTIME2THR_E</name>
	<description>Event, set to '1' when the symboltime counter matched SymbolTime2Thr
This event bit contributes to ftdf_ce[3]. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYMBOLTIMETHR_E</name>
	<description>Event, set to '1' when the symboltime counter matched SymbolTimeThr
This event bit contributes to ftdf_ce[3]. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYNCTIMESTAMP_E</name>
	<description>The SyncTimeStamp_e event is set to '1' when the TimeStampgenerator is loaded with SyncTimeStampVal.
This occurs at the rising edge of lp_clk when SyncTimeStampEna is set and the value of the Event generator is equal to the value SyncTimestampThr.
This event bit contributes to ftdf_ce[3]. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LMACREADY4SLEEP_D</name>
	<description>Delta bit for register LmacReady4sleep.
This delta bit is set to '1' on each change of this status, contributes to ftdf_ce[3]. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_MASK_REG</name>
	<description>Lmac mask control register</description>
	<addressOffset>0x00010080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007e</resetMask>
	<fields><field>
	<name>WAKEUPTIMERENABLESTATUS_M</name>
	<description>Mask for WakeupTimerEnableStatus_d
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GETGENERATORVAL_M</name>
	<description>Mask for getGeneratorVal_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYMBOLTIME2THR_M</name>
	<description>Mask for SymbolTime2Thr_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYMBOLTIMETHR_M</name>
	<description>Mask for SymbolTimeThr_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYNCTIMESTAMP_M</name>
	<description>Mask bit for event register SyncTimeStamp_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LMACREADY4SLEEP_M</name>
	<description>Mask bit for delta bit LmacReady4sleep_d.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_OS_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>CSMA_CA_RESUME_CLEAR</name>
	<description>If set, Csma_Ca_resume_stat is cleared </description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CSMA_CA_RESUME_SET</name>
	<description>If set, Csma_Ca_resume_stat is set </description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>SINGLECCA</name>
	<description>If set to '1', a single CCA will be performed.
This can be used when e.g. the TSCH timing is not performed by the LMAC but completely by software. </description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>RXENABLE</name>
	<description>If set, receiving data may be done </description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>GETGENERATORVAL</name>
	<description>If set to '1', the current values of the Wake-up (event) counter/generator (EventCurrVal) and Timestamp (symbol) counter/generator (TimeStampCurrVal and TimeStampCurrPhaseVal) will be captured.
Note that this capture actually has been done when getGeneratorVal_e is set (assuming it was cleared in advance). </description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_STATUS_REG</name>
	<description>Lmac status register</description>
	<addressOffset>0x00010054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CSMA_CA_BO_STAT</name>
	<description>The value of the currently calculated BackOff value. To be used for the sleep time calculation in case of sleep during the BackOff time. </description>
	<bitRange>[31:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CSMA_CA_RESUME_STAT</name>
	<description>In case Csma_Ca_resume_stat is set the LMAC will
- use the value of Csma_Ca_NB_val in the CSMA-CA process rather than the initial value 0d.
- immediately perform CCA after the sleep, not waiting for the backoff time.
- reset Csma_Ca_resume_stat when it resumes CSMA-CA after the sleep. </description>
	<bitRange>[19:19]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CSMA_CA_NB_STAT</name>
	<description>Current status of the Number of Backoffs. </description>
	<bitRange>[18:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EDSCANVALUE</name>
	<description>The result of an ED scan. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>WAKEUPTIMERENABLESTATUS</name>
	<description>Status of WakeupTimerEnable after being clocked by LP_CLK (showing it's effective value).
WakeupTimerEnableStatus can be set by setting the one-shot register WakeupTimerEnable_set and cleared by setting the one-shot register WakeupTimerEnable_clear.
When WakeupTimerEnableStatus is set (after being cleared), the event counter will be reset to 0x0.

