nguyentri/da-pac/svd/DA14683.svd
# $software_scratch@retention_ram
# TX ram not used by hardware, can be used by software as scratch ram with retention. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ISPANID_COORD_ERROR</name>
	<description>Rx meta data per entry: if set to '1', the received frame is not for PAN coordinator, applicable when frame is not discarded </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPANID_ERROR</name>
	<description>Rx meta data per entry: if set to '1', a PAN ID error has occurred, applicable when frame is not discarded </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DADDR_ERROR</name>
	<description>Rx meta data per entry: if set to '1', a destination Address error has occurred, applicable when frame is not discarded </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DPANID_ERROR</name>
	<description>Rx meta data per entry: if set to '1', a destination PAN ID error has occurred, applicable when frame is not discarded </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RES_FRM_VERSION_ERROR</name>
	<description>Rx meta data per entry: if set to '1' this frame is a not supported frame version, applicable when frame is not discarded. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RES_FRM_TYPE_ERROR</name>
	<description>Rx meta data per entry: if set to '1' this frame is a not supported frame type, applicable when frame is not discarded </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CRC16_ERROR</name>
	<description>Rx meta data per entry: if set, a CRC error has occurred in this frame, applicable for transparent mode only </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_STATUS_DELTA_REG</name>
	<description>Receive status delta register</description>
	<addressOffset>0x00010220</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>RX_BUFF_IS_FULL_D</name>
	<description>Delta bit of status rx_buff_is_full.
This delta bit is set to '1' on each change of this status, contributes to ftdf_ce[1]. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_STATUS_MASK_REG</name>
	<description>Receive status delta mask register</description>
	<addressOffset>0x00010224</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>RX_BUFF_IS_FULL_M</name>
	<description>Mask bit for delta bit rx_buff_is_full_d
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_STATUS_REG</name>
	<description>Receive status register</description>
	<addressOffset>0x0001020c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>RX_WRITE_BUF_PTR</name>
	<description>Indication where new data will be written.
All four bits shall be used when using these pointer values (0d - 15d).
However, the Receive Packet buffer has a size of 8 entries.
So reading the Receive Packet buffer entries shall use the mod8 of the pointer values. </description>
	<bitRange>[4:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RX_BUFF_IS_FULL</name>
	<description>If set to '1', it indicates that the Rx packet buffer is full </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_SECKEY_0_REG</name>
	<description>Seckey register</description>
	<addressOffset>0x00010118</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SECKEY_0</name>
	<description>Encryption/decryption mode: Registers secKey[0..3] contain the key to be used. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECKEY_1_REG</name>
	<description>Seckey register</description>
	<addressOffset>0x0001011c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SECKEY_1</name>
	<description>Encryption/decryption mode: see register secKey_0 </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECKEY_2_REG</name>
	<description>SecKey register</description>
	<addressOffset>0x00010120</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SECKEY_2</name>
	<description>Encryption/decryption mode: see register secKey_0 </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECKEY_3_REG</name>
	<description>Seckey register</description>
	<addressOffset>0x00010124</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SECKEY_3</name>
	<description>Encryption/decryption mode: see register secKey_0</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECNONCE_0_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x00010128</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SECNONCE_0</name>
	<description>Encryption/decryption mode: register secNonce[0..3] contains the Nonce to be used for encryption/decryption. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECNONCE_1_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x0001012c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SECNONCE_1</name>
	<description>Encryption/decryption mode: see register Nonce_0 </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECNONCE_2_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x00010130</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SECNONCE_2</name>
	<description>Encryption/decryption mode: see register Nonce_0 </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECNONCE_3_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x00010134</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SECNONCE_3</name>
	<description>Encryption/decryption mode: see register Nonce_0 </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECURITY_0_REG</name>
	<description>Security register</description>
	<addressOffset>0x00010110</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SECENCDECN</name>
	<description>Encryption/decryption mode: the control register secEncDecn indicates whether to encrypt ('1') or decrypt ('0') the data. </description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SECMLENGTH</name>
	<description>Encryption/decryption mode: the length of the m_data is indicated by control register secMlength (in bytes). </description>
	<bitRange>[30:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SECALENGTH</name>
	<description>Encryption/decryption mode: the length of the a_data is indicated by control register secAlength (in bytes).
The end of the a_data is the start point of the m_data. So secAlength must also be set if security level==4. </description>
	<bitRange>[22:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SECENTRY</name>
	<description>Encryption/decryption mode: the software indicates by the control registers secEntry and secTxRxn which entry to use and if it's from the Tx or Rx buffer ('1' resp. '0'). </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SECTXRXN</name>
	<description>Encryption/decryption mode: see register secEntry. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECURITY_1_REG</name>
	<description>Security register</description>
	<addressOffset>0x00010114</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SECENCRFLAGS</name>
	<description>Encryption/decryption mode: register secEncrFlags contains the encryption flags field.
Bits [2:0] are the 3-bit encoding flags of a_data, the other bits msut be set to '0'. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SECAUTHFLAGS</name>
	<description>Encryption/decryption mode: register secAuthFlags contains the authentication flags fields.
bit[7] is '0'
bit[6] is A_data present
bit[5:3]: 3-bit security level of m_data
bit[2:0]: 3-bit security level of a_data. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECURITY_EVENTMASK_REG</name>
	<description>security event mask register</description>
	<addressOffset>0x00010154</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>SECREADY_M</name>
	<description>Mask bit for event secReady_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECURITY_EVENT_REG</name>
	<description>security event register</description>
	<addressOffset>0x00010150</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>SECREADY_E</name>
	<description>Encryption/decryption mode: the Event bit secReady_e is set to '1' when the authentication process is ready (i.e. secBusy is cleared).
This event bit contributes to ftdf_ce[3]. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SECURITY_OS_REG</name>
	<description>One shot register to start encryption/decryption</description>
	<addressOffset>0x00010138</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>SECSTART</name>
	<description>Encryption/decryption mode: one_shot register to start the encryption, decryption and authentication support task. </description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>SECABORT</name>
	<description>Encryption/decryption mode: see register Nonce_0 </description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>FTDF_SECURITY_STATUS_REG</name>
	<description>Security status register</description>
	<addressOffset>0x00010140</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>SECAUTHFAIL</name>
	<description>Encryption/decryption mode: in case of decryption, the status bit secAuthFail will be set when the authentication has failed. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SECBUSY</name>
	<description>Encryption/decryption mode: register secBusy indicates if the encryption/decryption process is still running. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_SIZE_AND_VAL_0_REG</name>
	
