nguyentri/da-pac/svd/DA14683.svd
	<description>Tx meta data per entry: '1' indicates that an acknowledge is expected from the recipient of this packet. </description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CSMACA_ENA</name>
	<description>Tx meta data per entry: '1' indicates that a CSMA-CA is required for the transmission of this packet. </description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRAMETYPE</name>
	<description>Tx meta data per entry: the frame type of the data to be transmitted (Data/Cmd/Ack/wakeup frame/etc.). </description>
	<bitRange>[25:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<bitRange>[21:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<bitRange>[18:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<bitRange>[14:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<bitRange>[10:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRAME_LENGTH</name>
	<description>Tx meta data per entry: Frame length (in bytes) </description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_2_REG</name>
	<description>Transmit metadata register 2</description>
	<addressOffset>0x00000220</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields><field>
	<name>CRC16_ENA</name>
	<description>Tx meta data per entry: Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ACKREQUEST</name>
	<description>Tx meta data per entry: '1' indicates that an acknowledge is expected from the recipient of this packet. </description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CSMACA_ENA</name>
	<description>Tx meta data per entry: '1' indicates that a CSMA-CA is required for the transmission of this packet. </description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRAMETYPE</name>
	<description>Tx meta data per entry: the frame type of the data to be transmitted (Data/Cmd/Ack/wakeup frame/etc.). </description>
	<bitRange>[25:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<bitRange>[21:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<bitRange>[18:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<bitRange>[14:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<bitRange>[10:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRAME_LENGTH</name>
	<description>Tx meta data per entry: Frame length (in bytes) </description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_3_REG</name>
	<description>Transmit metadata register 3</description>
	<addressOffset>0x00000230</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields><field>
	<name>CRC16_ENA</name>
	<description>Tx meta data per entry: Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ACKREQUEST</name>
	<description>Tx meta data per entry: '1' indicates that an acknowledge is expected from the recipient of this packet. </description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CSMACA_ENA</name>
	<description>Tx meta data per entry: '1' indicates that a CSMA-CA is required for the transmission of this packet. </description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRAMETYPE</name>
	<description>Tx meta data per entry: the frame type of the data to be transmitted (Data/Cmd/Ack/wakeup frame/etc.). </description>
	<bitRange>[25:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<bitRange>[21:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<bitRange>[18:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<bitRange>[14:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<bitRange>[10:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRAME_LENGTH</name>
	<description>Tx meta data per entry: Frame length (in bytes) </description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_1_0_REG</name>
	<description>Transmit metadata register 0</description>
	<addressOffset>0x00000204</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>MACSN</name>
	<description>Tx meta data per entry: Sequence Number of this packet. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_1_1_REG</name>
	<description>Transmit metadata register 1</description>
	<addressOffset>0x00000214</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>MACSN</name>
	<description>Tx meta data per entry: Sequence Number of this packet. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_1_2_REG</name>
	<description>Transmit metadata register 2</description>
	<addressOffset>0x00000224</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>MACSN</name>
	<description>Tx meta data per entry: Sequence Number of this packet. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_1_3_REG</name>
	<description>Transmit metadata register 3</description>
	<addressOffset>0x00000234</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>MACSN</name>
	<description>Tx meta data per entry: Sequence Number of this packet. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_PRIORITY_0_REG</name>
	<description>Transmit priority register 0</description>
	<addressOffset>0x00010410</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000f1f</resetMask>
	<fields><field>
	<name>PTI_TX</name>
	<description>This register has 4 entries, belonging to the entry of the Tx frame to send, to be used during transmitting frames and the CMSA-CA phase before (when requested).
In TSCH mode this register shall be used during the time slot in which frames can be transmitted and consequently an Enhanced ACK can be received.
Since pti_tx belongs to a certain frame to be transmitted, pti_tx can be considered as extra Tx meta data. </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ISWAKEUP</name>
	<description>Tx meta data per entry: A basic wake-up frame can be generated by the UMAC in the Tx buffer.
The meta data control bit IsWakeUp must be set to indicate that this is a Wake-up frame. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_PRIORITY</name>
	<description>Tx meta data per entry: Priority of packet </description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_PRIORITY_1_REG</name>
	<description>Transmit priority register 1</description>
	<addressOffset>0x00010430</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000f1f</resetMask>
	<fields><field>
	<name>PTI_TX</name>
	<description>This register has 4 entries, belonging to the entry of the Tx frame to send, to be used during transmitting frames and the CMSA-CA phase before (when requested).
In TSCH mode this register shall be used during the time slot in which frames can be transmitted and consequently an Enhanced ACK can be received.
Since pti_tx belongs to a certain frame to be transmitted, pti_tx can be considered as extra Tx meta data. </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ISWAKEUP</name>
	<description>Tx meta data per entry: A basic wake-up frame can be generated by the UMAC in the Tx buffer.
The meta data control bit IsWakeUp must be set to indicate that this is a Wake-up frame. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_PRIORITY</name>
	<description>Tx meta data per entry: Priority of packet </description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_PRIORITY_2_REG</name>
	<description>Transmit priority register 2</description>
	<addressOffset>0x00010450</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000f1f</resetMask>
	<fields><field>
	<name>PTI_TX</name>
	<description>This register has 4 entries, belonging to the entry of the Tx frame to send, to be used during transmitting frames and the CMSA-CA phase before (when requested).
In TSCH mode this register shall be used during the time slot in which frames can be transmitted and consequently an Enhanced ACK can be received.
Since pti_tx belongs to a certain frame to be transmitted, pti_tx can be considered as extra Tx meta data. </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ISWAKEUP</name>
	<description>Tx meta data per entry: A basic wake-up frame can be generated by the UMAC in the Tx buffer.
The meta data control bit IsWakeUp must be set to indicate that this is a Wake-up frame. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_PRIORITY</name>
	<description>Tx meta data per entry: Priority of packet </description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_PRIORITY_3_REG</name>
	<description>Transmit priority register 3</description>
	<addressOffset>0x00010470</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000f1f</resetMask>
	<fields><field>
	<name>PTI_TX</name>
	<description>This register has 4 entries, belonging to the entry of the Tx frame to send, to be used during transmitting frames and the CMSA-CA phase before (when requested).
In TSCH mode this register shall be used during the time slot in which frames can be transmitted and consequently an Enhanced ACK can be received.
Since pti_tx belongs to a certain frame to be transmitted, pti_tx can be considered as extra Tx meta data. </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ISWAKEUP</name>
	<description>Tx meta data per entry: A basic wake-up frame can be generated by the UMAC in the Tx buffer.
The meta data control bit IsWakeUp must be set to indicate that this is a Wake-up frame. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_PRIORITY</name>
	<description>Tx meta data per entry: Priority of packet </description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_0_0_REG</name>
	<description>Transmit status register 0</description>
	<addressOffset>0x00000240</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TXTIMESTAMP</name>
	<description>Tx return status per entry: Transmit Timestamp
The Timestamp of the transmitted packet. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_0_1_REG</name>
	<description>Transmit status register 1</description>
	<addressOffset>0x00000250</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TXTIMESTAMP</name>
	<description>Tx return status per entry: Transmit Timestamp
The Timestamp of the transmitted packet. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_0_2_REG</name>
	<description>Transmit status register 2</description>
	<addressOffset>0x00000260</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TXTIMESTAMP</name>
	<description>Tx return status per entry: Transmit Timestamp
The Timestamp of the transmitted packet. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_0_3_REG</name>
	<description>Transmit status register 3</description>
	<addressOffset>0x00000270</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TXTIMESTAMP</name>
	<description>Tx return status per entry: Transmit Timestamp
The Timestamp of the transmitted packet. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_1_0_REG</name>
	<description>Transmit status register 0</description>
	<addressOffset>0x00000244</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>CSMACANRRETRIES</name>
	<description>Tx return status per entry: Number of CSMA-CA retries before this frame has been transmitted </description>
	<bitRange>[4:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CSMACAFAIL</name>
	<description>Tx return status per entry: CSMA-CA status
0 : SUCCESS
1 : FAIL </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ACKFAIL</name>
	<description>Tx return status per entry: Acknowledgement status
0 : SUCCESS
1 : FAIL </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_1_1_REG</name>
	<description>Transmit status register 1</description>
	<addressOffset>0x00000254</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>CSMACANRRETRIES</name>
	<description>Tx return status per entry: Number of CSMA-CA retries before this frame has been transmitted </description>
	<bitRange>[4:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CSMACAFAIL</name>
	<description>Tx return status per entry: CSMA-CA status
0 : SUCCESS
1 : FAIL </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ACKFAIL</name>
	<description>Tx return status per entry: Acknowledgement status
0 : SUCCESS
1 : FAIL </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_1_2_REG</name>
	<description>Transmit status register 2</description>
	<addressOffset>0x00000264</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>CSMACANRRETRIES</name>
	<description>Tx return status per entry: Number of CSMA-CA retries before this frame has been transmitted </description>
	<bitRange>[4:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CSMACAFAIL</name>
	<description>Tx return status per entry: CSMA-CA status
0 : SUCCESS
1 : FAIL </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ACKFAIL</name>
	<description>Tx return status per entry: Acknowledgement status
0 : SUCCESS
1 : FAIL </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_1_3_REG</name>
	<description>Transmit status register 3</description>
	<addressOffset>0x00000274</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>CSMACANRRETRIES</name>
	<description>Tx return status per entry: Number of CSMA-CA retries before this frame has been transmitted </description>
	<bitRange>[4:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CSMACAFAIL</name>
	<description>Tx return status per entry: CSMA-CA status
0 : SUCCESS
1 : FAIL </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ACKFAIL</name>
	<description>Tx return status per entry: Acknowledgement status
0 : SUCCESS
1 : FAIL </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_SET_OS_REG</name>
	<description>One shot register to set flag</description>
	<addressOffset>0x00010480</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>TX_FLAG_SET</name>
	<description>Tx meta data per entry: if set to '1', the tx_flag_stat will be set to '1'. </description>
	<bitRange>[3:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>FTDF_WAKEUP_CONTROL_OS_REG</name>
	
	<addressOffset>0x00010364</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>WAKEUPTIMERENABLE_CLEAR</name>
	<description>If set, WakeupTimerEnableStatus will be cleared. </description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>WAKEUPTIMERENABLE_SET</name>
	<description>If set, WakeupTimerEnableStatus will be set. </description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>FTDF_WAKEUP_CONTROL_REG</name>
	<description>Wakeup timer vcontrol register</description>
	<addressOffset>0x00011000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x40000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>WAKEUP_MODE</name>
	<description>The Control register WakeUp_mode controls the behavior of the Event counter:
0d = off, 1d = free running (default), 2d = one shot with auto clear, 3d = configurable period (timer
mode). </description>
	<bitRange>[31:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WAKEUPENABLE</name>
	<description>If set to '1', the WakeUpIntThr is enabled to generate an WAKEUP_IRQ interrupt. </description>
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WAKEUPINTTHR</name>
	<description>Threshold for wake-up interrupt. When WakeUpEnable is set to '1' and the Wake-up (event) counter matches this value, the interrupt WAKEUP_IRQ is set to '1' for the duration of one LP_CLK period. </description>
	<bitRange>[24:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GP_TIMERS</name>
	<version>1.0</version>
	<description>GP_TIMERS registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003400</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>32</size>
	<usage>registers</usage>
</addressBlock>
	
